TexasInstruments/mcupsdk-core/examples/industrial_comms/ethercat_iolink_gateway_demo/am243x-evm/r5fss0-0_freertos/example.syscfg
gpio15.$name                = "CONFIG_IOL_FAULTN3";
gpio15.GPIO.$assign         = "GPIO0";
gpio15.GPIO.gpioPin.pu_pd   = "pu";
gpio15.GPIO.gpioPin.$assign = "ball.T18";

gpio16.$name                = "CONFIG_IOL_TX4";
gpio16.pinDir               = "OUTPUT";
gpio16.GPIO.$assign         = "GPIO1";
gpio16.GPIO.gpioPin.rx      = false;
gpio16.GPIO.gpioPin.$assign = "ball.R6";

gpio17.$name                = "CONFIG_IOL_RX4";
gpio17.GPIO.$assign         = "GPIO1";
gpio17.GPIO.gpioPin.$assign = "ball.V2";

gpio18.$name                = "CONFIG_IOL_TXEN4";
gpio18.pinDir               = "OUTPUT";
gpio18.GPIO.$assign         = "GPIO1";
gpio18.GPIO.gpioPin.rx      = false;
gpio18.GPIO.gpioPin.$assign = "ball.Y4";

gpio19.$name                = "CONFIG_IOL_ENL4";
gpio19.pinDir               = "OUTPUT";
gpio19.GPIO.$assign         = "GPIO1";
gpio19.GPIO.gpioPin.rx      = false;
gpio19.GPIO.gpioPin.$assign = "ball.W2";

gpio20.$name                = "CONFIG_IOL_FAULTN4";
gpio20.GPIO.$assign         = "GPIO0";
gpio20.GPIO.gpioPin.pu_pd   = "pu";
gpio20.GPIO.gpioPin.$assign = "ball.U20";

gpio21.$name                = "CONFIG_IOL_TX5";
gpio21.pinDir               = "OUTPUT";
gpio21.GPIO.$assign         = "GPIO1";
gpio21.GPIO.gpioPin.rx      = false;
gpio21.GPIO.gpioPin.$assign = "ball.V4";

gpio22.$name                = "CONFIG_IOL_RX5";
gpio22.GPIO.$assign         = "GPIO1";
gpio22.GPIO.gpioPin.$assign = "ball.AA2";

gpio23.$name                = "CONFIG_IOL_TXEN5";
gpio23.pinDir               = "OUTPUT";
gpio23.GPIO.$assign         = "GPIO1";
gpio23.GPIO.gpioPin.rx      = false;
gpio23.GPIO.gpioPin.$assign = "ball.T6";

gpio24.$name                = "CONFIG_IOL_ENL5";
gpio24.pinDir               = "OUTPUT";
gpio24.GPIO.$assign         = "GPIO1";
gpio24.GPIO.gpioPin.rx      = false;
gpio24.GPIO.gpioPin.$assign = "ball.V3";

gpio25.$name                = "CONFIG_IOL_FAULTN5";
gpio25.GPIO.$assign         = "GPIO0";
gpio25.GPIO.gpioPin.pu_pd   = "pu";
gpio25.GPIO.gpioPin.$assign = "ball.U18";

gpio26.$name                = "CONFIG_IOL_TX6";
gpio26.pinDir               = "OUTPUT";
gpio26.GPIO.$assign         = "GPIO1";
gpio26.GPIO.gpioPin.rx      = false;
gpio26.GPIO.gpioPin.$assign = "ball.T5";

gpio27.$name                = "CONFIG_IOL_RX6";
gpio27.GPIO.$assign         = "GPIO1";
gpio27.GPIO.gpioPin.$assign = "ball.R3";

gpio28.$name                = "CONFIG_IOL_TXEN6";
gpio28.pinDir               = "OUTPUT";
gpio28.GPIO.$assign         = "GPIO1";
gpio28.GPIO.gpioPin.rx      = false;
gpio28.GPIO.gpioPin.$assign = "ball.U6";

gpio29.$name                = "CONFIG_IOL_ENL6";
gpio29.pinDir               = "OUTPUT";
gpio29.GPIO.$assign         = "GPIO1";
gpio29.GPIO.gpioPin.rx      = false;
gpio29.GPIO.gpioPin.$assign = "ball.T4";

gpio30.$name                = "CONFIG_IOL_FAULTN6";
gpio30.GPIO.$assign         = "GPIO0";
gpio30.GPIO.gpioPin.pu_pd   = "pu";
gpio30.GPIO.gpioPin.$assign = "ball.U19";

gpio31.$name                = "CONFIG_IOL_TX7";
gpio31.pinDir               = "OUTPUT";
gpio31.GPIO.$assign         = "GPIO1";
gpio31.GPIO.gpioPin.rx      = false;
gpio31.GPIO.gpioPin.$assign = "ball.U4";

gpio32.$name                = "CONFIG_IOL_RX7";
gpio32.GPIO.$assign         = "GPIO1";
gpio32.GPIO.gpioPin.$assign = "ball.T3";

gpio33.$name                = "CONFIG_IOL_TXEN7";
gpio33.pinDir               = "OUTPUT";
gpio33.GPIO.$assign         = "GPIO1";
gpio33.GPIO.gpioPin.rx      = false;
gpio33.GPIO.gpioPin.$assign = "ball.U5";

gpio34.$name                = "CONFIG_IOL_ENL7";
gpio34.pinDir               = "OUTPUT";
gpio34.GPIO.$assign         = "GPIO1";
gpio34.GPIO.gpioPin.rx      = false;
gpio34.GPIO.gpioPin.$assign = "ball.W3";

gpio35.$name                = "CONFIG_IOL_FAULTN7";
gpio35.GPIO.$assign         = "GPIO0";
gpio35.GPIO.gpioPin.pu_pd   = "pu";
gpio35.GPIO.gpioPin.$assign = "ball.V20";

gpio36.$name                = "CONFIG_IOL_TX8";
gpio36.pinDir               = "OUTPUT";
gpio36.GPIO.$assign         = "GPIO1";
gpio36.GPIO.gpioPin.rx      = false;
gpio36.GPIO.gpioPin.$assign = "ball.U1";

gpio37.$name                = "CONFIG_IOL_RX8";
gpio37.GPIO.$assign         = "GPIO1";
gpio37.GPIO.gpioPin.$assign = "ball.T1";

gpio38.$name                = "CONFIG_IOL_TXEN8";
gpio38.pinDir               = "OUTPUT";
gpio38.GPIO.$assign         = "GPIO1";
gpio38.GPIO.gpioPin.rx      = false;
gpio38.GPIO.gpioPin.$assign = "ball.AA4";

gpio39.$name                = "CONFIG_IOL_ENL8";
gpio39.pinDir               = "OUTPUT";
gpio39.GPIO.$assign         = "GPIO1";
gpio39.GPIO.gpioPin.rx      = false;
gpio39.GPIO.gpioPin.$assign = "ball.P4";

gpio40.$name                = "CONFIG_IOL_FAULTN8";
gpio40.GPIO.$assign         = "GPIO0";
gpio40.GPIO.gpioPin.pu_pd   = "pu";
gpio40.GPIO.gpioPin.$assign = "ball.V21";

gpio41.$name                    = "CONFIG_GPIO_LED_STATUS";
led1.peripheralDriver           = gpio41;
gpio41.pinDir                   = "OUTPUT";
gpio41.useMcuDomainPeripherals  = true;
gpio41.MCU_GPIO.gpioPin.rx      = false;
gpio41.MCU_GPIO.gpioPin.$assign = "ball.A7";

i2c1.$name       = "CONFIG_I2C1";
i2c1.I2C.$assign = "I2C2";

i2c2.$name            = "CONFIG_I2C0";
led2.peripheralDriver = i2c2;
led3.peripheralDriver = i2c2;
led4.peripheralDriver = i2c2;
led5.peripheralDriver = i2c2;
i2c2.I2C.$assign      = "I2C1";

mcspi1.$name                       = "CONFIG_MCSPI_IOL";
mcspi1.mode                        = "MULTI_CONTROLLER";
mcspi1.intrEnable                  = "POLLED";
mcspi1.SPI.$assign                 = "SPI1";
mcspi1.SPI.CLK.$assign             = "ball.C14";
mcspi1.SPI.D0.$assign              = "ball.B15";
mcspi1.SPI.D1.$assign              = "ball.A15";
mcspi1.mcspiChannel.create(2);
mcspi1.mcspiChannel[0].$name       = "CONFIG_MCSPI_CH0";
mcspi1.mcspiChannel[0].CSn.$assign = "ball.B14";
mcspi1.mcspiChannel[1].$name       = "CONFIG_MCSPI_CH1";
mcspi1.mcspiChannel[1].CSn.$assign = "ball.D14";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
pruicss1.iepSyncMode                     = scripting.forceWrite(true);
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO0";

uart1.$name = "CONFIG_UART_CONSOLE";

uart2.$name                   = "CONFIG_UART_SMI";
uart2.readMode                = "CALLBACK";
uart2.writeMode               = "CALLBACK";
uart2.readCallbackFxn         = "vUartRxCallback";
uart2.writeCallbackFxn        = "vUartTxCallback";
uart2.useMcuDomainPeripherals = true;

ethercat1.$name              = "CONFIG_ETHERCAT0";
ethercat1.instance           = "ICSSG1";
ethercat1.ethphy[0].$name    = "CONFIG_ETHPHY0";
ethercat1.ethphy[1].$name    = "CONFIG_ETHPHY1";
ethercat1.ethphy[1].mdioPort = 3;

